"""
    字典练习
"""
dict_1 = {
    "王丽红":{
        "部门":"科技部",
        "工资":3000,
        "级别":1
    },
    "洲杰伦":{
        "部门":"市场部",
        "工资":5000,
        "级别":2
    },
    "凌俊杰":{
        "部门":"市场部",
        "工资":7000,
        "级别":3
    },
    "张雪又":{
        "部门":"科技部",
        "工资":4000,
        "级别":1
    },
    "刘德花":{
        "部门":"市场部",
        "工资":6000,
        "级别":2
    }
}
print(dict_1)
for i in dict_1:
    if(dict_1[i]["级别"] == 1):
        dict_1[i]["级别"] += 1
        dict_1[i]["工资"] += 1000
print(dict_1)