"""
 字符串的三种使用和转移字符再字符串中表示引号
"""
# 1.单引号表示字符串
name = 'andi'
print( name)
# 2.双引号表示字符串
name = "andi1"
print( name)
# 3.三引号表示字符串(为返回则当作多行注释来做)
name = """
    andi3
"""
print( name)

# 转义字符来表示字符串
name = "\"andi111\""
print(name)
# 不同搭配的引号代替代效来表示字符串
name = "'andi2222'"
print(name)
name = '"andi3333"'
print(name)

print("-----------------------------------------------")

"""
    字符串拼接
"""
print("heimacxy"+"yxgw")

name = "黑麦草"
address = "上海"
print(name +"来自" +address)
# 错误示范，字符串不能直接拼接数值类型 print(name +"来自" +address+ 1234)

print("-----------------------------------------------")
# 占位符实现字符串拼接
name = "heimacxyuan"
number = 666
float_num = 66.666
print("我叫%s,编号是%s,价格是%s"%(name, number,float_num))
print("我叫%s,编号是%d,价格是%f"%(name, number,float_num))
print("-----------------------------------------------")
# 字符串格式化的精度控制 %m.nd m为整数，n为小数位
print("数字11的字符长度控制为5,四十五入为2:%5.2f"%11)
print("数字11的字符长度控制为1,四十五入为2:%1.2d"%11)
print("数字11.128的字符长度控制为6,四十五入为2:%6.2f"%11.128)
print("数字11.128的字符长度控制为6,四十五入为5:%6.2f"%11.128)
print("-----------------------------------------------")
# 快捷格式化方法
print(f"数字11的字符长度控制为5,四十五入为2:{11.118:7.2f}")
print("-----------------------------------------------")
print("数字为:%d%d"%(1*2, 3*4))